{
    "architectures": [
        "T5WithLMHeadModel"
    ],
    "pad_token_id": 0,
    "decoder_start_token_id": 0,
    "bos_token_id": 1,
    "eos_token_id": 2,

    "num_layers": 6,
    "num_decoder_layers": 36,

    "feed_forward_proj": "relu",
    "initializer_factor": 1.0,
    "is_encoder_decoder": true,
    "layer_norm_epsilon": 1e-06,
    "model_type": "t5",
    "n_positions": 768,
    "dropout_rate": 0.1,
    "output_past": true,
    "relative_attention_num_buckets": 32,
    "transformers_version": "4.16.2",
    "use_cache": true,
    "vocab_size": 32100
}
